{
  "personalInfo": {
    "name": "Betsin Kuruvila Mekkat",
    "email": "betsingmr@gmail.com",
    "linkedin": "https://www.linkedin.com/in/betsin-kuruvila-mekkat/",
  },
  "summary": "Results-driven react developer with a solid foundation in front-end development, specialising in creating dynamic and responsive web applications. Proficient in React.js, Javascript and modern libraries. I excelled in building user interface not only visually appealing but also highly functional.",
  "education": [
    {
      "degree": "Bachelor of Technology in Information Technology",
      "institution": "Hindusthan College of Engineering and Technology, Coimbatore",
      "year": "2018 – 2022"
    }
  ],
  "languagesAndSkills": {
    "skills": ["Reactjs", "Typescript", "Redux", "HTML", "CSS", "JavaScript", "Bootstrap", "Agile", "Git"]
  },
  "workExperience": [
    {
      "position": "Senior System Engineer",
      "company": "Infosys Limited",
      "duration": "August 2022 - Present",
      "location": "Mysore, India",
      "projects": [
        {
          "name": "UIM (User Identity Management)",
          "description": "This project focused on developing a robust User Identity Management system, aimed at enhancing user authentication and access control functionalities. As a Developer, I played a key role in creating a responsive and user-friendly interface using React 17, ensuring an optimal user experience across various devices.",
        },
        {
          "name": "Brownie Reward System",
          "description": "Developed a role-based web application designed to reward managers with ‘Brownie Points’ for acquiring new skills or completing specific tasks. Implemented user interfaces for both admin and reviewer roles, enhancing application usability and security. Crafted a responsive and user-friendly interface, significantly enhancing user experience using React 17. Ensured seamless functionality across multiple device types, improving accessibility and engagement. Facilitated a motivational environment by providing tangible rewards, leading to increased productivity and skill development among managerial staff.",
        }
      ]
    },
    {
      "position": "Intern",
      "company": "The Champions Group",
      "duration": "December 2019",
      "location": "Bangalore, India",
      "achievements": [
        "Assisted in organising and managing project documentation, leading to a 20% reduction in time spent on document retrieval.",
        "Contributed to the creation of project reports and presentations, enhancing team productivity and communication efficiency."
      ]
    }
  ],
  "projects": [
    {
      "name": "Netflix Clone",
      "description": "Building a Netflix-like web application to enhance React and TypeScript skills.",
      "technologiesUsed": ["React", "TypeScript", "TMDb API", "CSS Modules"],
      "learningGoals": "Focused on mastering React Router, dynamic API integration, and creating responsive UIs.",
      "link": "https://github.com/betzn04/Netflix-clone"
    }
  ]
}
